_build/diagrams/get_started.dot
digraph get_started {
    label = "GET STARTED";
    labelloc="t";
    fontname="Takota";
    node [shape="plain", style = "rounded", 
    fontname="Takota", fontsize=12]
    st1 [label = "CHOOSE A THEME, \n GENRE, OR SETTING"];
    st2 [label = "SEARCH FOR \n RELEVANT TROPES"];
    id1 [label = "SET STARTING SCENE"];
    pg1 [label = "MAKE A PROTAGONIST"];
    pg2 [label = "LOOK AT PROTAGONIST'S \n GOAL AND NEMESIS"];
    id2 [label = "PLAY THE SCENE"];

    st1, st2 -> pg1;
    pg1 -> id1, st1;
    pg1 -> pg2 [style = "dotted"];
    pg2 -> id1 [style = "dotted"];
    id1 -> id2;

}
